{
  "backend/main.mo": "Defines core types and logic for users, players, matches, contests, and fantasy teams with authorization checks and CRUD-style methods.",
  "feature_evidence.json": "Lists feature-to-file mappings with evidence for authentication timeout and error-state improvements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend components and hooks for build and documentation use.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables and dark-mode overrides.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, auth state, and conditionally shows profile setup modal.",
  "frontend/src/components/AccessDenied.tsx": "Renders an authorization error card with a redirect button for non-admin users.",
  "frontend/src/components/AdminScoringForm.tsx": "Admin UI for selecting matches, marking them finished, and submitting player point scores via backend hooks.",
  "frontend/src/components/AdminSeedPanel.tsx": "Provides admin forms to create matches, add players, and create contests using various query hooks and UI components.",
  "frontend/src/components/AppLayout.tsx": "Defines the main app layout with navigation, header, footer, auth controls, and routed content display.",
  "frontend/src/components/AuthControls.tsx": "Handles login/logout with Internet Identity, showing appropriate buttons and managing auth state.",
  "frontend/src/components/AuthInitStatusBanner.tsx": "Displays authentication initialization status, showing loaders or error banners with retry options.",
  "frontend/src/components/JoinContestDialog.tsx": "Dialog for selecting a user team and joining a contest, with validation and join mutation handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to enter a name and choose an avatar, saving their profile via a query hook.",
  "frontend/src/components/TeamBuilder.tsx": "UI for selecting 11 players, assigning captain/vice-captain, and saving a fantasy team for a match.",
  "frontend/src/components/UserBadge.tsx": "Shows the logged‑in user’s avatar and name using their profile data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAuthInit.ts": "Tracks Internet Identity initialization with timeout handling, error states, and a retry mechanism.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity auth, managing login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, admin checks, matches, players, and contests.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, dark mode styles, and base typography.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface that checks admin status and shows tabs for data seeding and match scoring.",
  "frontend/src/pages/ContestDetailPage.tsx": "Displays contest details and leaderboard with loading states, navigation, and player data resolution.",
  "frontend/src/pages/ContestsPage.tsx": "Displays available contests for a match, handles loading states, contest status, and allows joining contests.",
  "frontend/src/pages/HomePage.tsx": "Shows a hero landing page for unauthenticated users and a match list for authenticated users with loading and error handling.",
  "frontend/src/pages/MatchDetailPage.tsx": "Shows match details, available players, and provides navigation to contests and team building.",
  "frontend/src/pages/MyContestsPage.tsx": "Lists the user's joined contests with status, prize pool, participants, and navigation to leaderboards.",
  "frontend/src/pages/MyTeamsPage.tsx": "Displays the user's fantasy teams with captain info, players, and handles loading or empty states.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, retrieving, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and extended theme values.",
  "project_state.json": "Stores project metadata, existing features, known issues, and the overall fantasy sports app build plan."
}