{
  "kind": "build_request",
  "title": "Fix infinite loading spinner on app start (Internet Identity init never finishes)",
  "projectName": "FantasyXI",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Prevent the application from being stuck indefinitely on the initial full-screen loading spinner by adding a hard timeout to Internet Identity initialization; when the timeout is hit (or initialization throws), exit the initializing state and allow the app UI to render.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Page show loading spinner that never finishes2m"
        ]
      },
      "acceptanceCriteria": [
        "If Internet Identity initialization takes longer than a fixed timeout (e.g., 10–15 seconds), the app stops showing the full-screen spinner and renders the normal app shell.",
        "The app is usable in an unauthenticated state even if Internet Identity initialization fails or times out (user can still see the unauthenticated home/hero and attempt login).",
        "The app no longer remains on the initial loading screen for ~2 minutes with no change."
      ]
    },
    {
      "id": "REQ-12",
      "text": "When Internet Identity initialization fails or times out, show a clear, user-facing error state with recovery actions instead of an endless spinner (e.g., “Failed to initialize authentication. Please refresh and try again.” with a “Retry” action).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Page show loading spinner that never finishes2m"
        ]
      },
      "acceptanceCriteria": [
        "If initialization errors or times out, a visible error message is shown (in English) rather than a never-ending loading indicator.",
        "A user can trigger a retry (without requiring a hard reload) to re-attempt Internet Identity initialization.",
        "The error state does not block navigation to unauthenticated content (home hero section still renders)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add lightweight diagnostics for the startup/auth initialization path so the cause of slow/hung initialization can be identified in browser logs (e.g., log when initialization starts, when AuthClient is created, when isAuthenticated resolves, and when initialization ends or times out).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Page show loading spinner that never finishes2m"
        ]
      },
      "acceptanceCriteria": [
        "Browser console logs clearly indicate the startup/auth initialization stages and whether a timeout or error occurred.",
        "Diagnostics do not expose any secret values (e.g., do not log admin tokens, delegations, or full identities)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only and must be composed).",
    "Do not modify immutable paths listed in SYSTEM_CONTEXT.",
    "Maintain Internet Identity as the only authentication mechanism (no third-party auth)."
  ],
  "nonGoals": [
    "Adding new product features unrelated to startup reliability.",
    "Changing backend data models or contest/team/scoring logic unless required to resolve the startup hang."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}